31-object-oriented-javascript/movies-api/app/controllers/api/v1/movies_controller.rb

  def index
    movies = Movie.all.sort_by { |movie| movie.title }
---
SELECT "movies".* FROM "movies"

  def create
    movie = Movie.new(movie_params)

    if movie.save
---
INSERT INTO "movies" ("title", "year", "score", "imageUrl", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    movie = Movie.find(params[:id])

    movie.update!(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 1], ["updated_at", "2020-09-21 15:48:16.051583"], ["id", 13]]

  def destroy
    movie = Movie.find(params[:id])

    movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 44]]