33-serializers/movies-api/app/serializers/movie_serializer.rb

  def cast
    self.object.movie_actors.map do |ma|
---
SELECT "movie_actors".* FROM "movie_actors" WHERE "movie_actors"."movie_id" = $1  [["movie_id", 2]]